# LockOverconstrained Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..LockOverconstrained Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Locking this dimension would overconstrain the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LockOverconstrained { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LockOverconstrained As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LockOverconstrained {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace